Revit 2027 API
PanelScheduleData.IsUnusedPhaseHidden Property
 True if the user wishes to hide the unused phase column of a single phase panel, false otherwise.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsUnusedPhaseHidden { get; set; }
Public Property IsUnusedPhaseHidden As Boolean
	Get
	Set
public:
property bool IsUnusedPhaseHidden {
	bool get ();
	void set (bool value);
}
member IsUnusedPhaseHidden : bool with get, set
Property Value
Boolean
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace